[
  {
    "name": "Taxes And Accounting",
    "descrip1": "Whether you need to plan for this April 15th or a few April 15ths, we provide you with recommendations for top tax accounting firms",
    "articleTitle": "10 Questions To Ask When Picking Your Tax Specialist",
    "quizTitle": "Calculate How much You Can Save On Your Tax Debt",
    "vlogTitle": "Free Tax Filing Seminar",

    "summary": "Filing taxes takes work, and if you make mistakes, the penalties can be costly. Thats why there are hundreds of firms that handle all the ends and outs of the tax world. As we at the wallet warriors are about giving you the tools to protect your money, all of the firms reviewed here specialize in advanced tax litigation. While most basic CPAs can do the work of these firms, they make it a mission to protect clients from the IRS and save them millions.",
    "vid1": "XrA_i2a8uvY",
    "vid2": "ky2jesjFHvk",
    "vid3": "UzOKOVSoUa4",
    "img1": "/taxes1.png",
    "img2": "/taxes2.jpg",
    "img3": "/taxes3.jpg",
    "video": "Free Tax Filing Seminar",
    "videoSummary": "Our Top Tax Experts Walk You Through Filing Your Most Common Tax Returns",
    "vertical": "tax",
    "navtext": "Taxes",
    "key": "1"
  },
  {
    "navtext": "Annuities",
    "name": "Annuities And TSAs",
    "articleTitle": "Unsure Which Type of Retirement Account is Right For You",
    "quizTitle": "How Much Do I Need To Retire?",
    "vlogTitle": "Retirement Account Rundown",

    "summary": "Everyone needs to plan for retirement. Making your money work for you so that one day you don't have to work for your money is part of our mission at Wallet Warriors. So we find firms that specialize in maximizing the growth of your retirement accounts, while providing you with a wealth of information on all the trends affecting your 401(k) or IRA.",
    "descrip1": "Retiring or planning on it? Our guides will walk you through how much you need and where you should invest it.",
    "vid1": "fQMU4UuJSBc",
    "vid2": "tP4zWCS4dMM",
    "vid3": "QyAxMOPA7Z0",
    "img1": "/annuities1.png",
    "img2": "/annuities2.jpeg",
    "img3": "/annuities3.jpg",
    "vertical": "annuity",
    "key": "2",
    "video": "Retirement Account Rundown",
    "videoSummary": "We Keep A Close Eye On Market Trends Affecting Retirment Accounts."
  },
  {
    "navtext": "Assets",
    "name": "Asset Diversification",
    "articleTitle": "Gold? Silver? Stocks? How should I Invest?",
    "quizTitle": "How Much Would My Money Be Worth Invested?",
    "vlogTitle": "Pro Market Strategies",

    "summary": "How the market moves determines what your money is worth. Taking stock in the markets and precious asset costs, we provide you with the tools to help you put money in and to make the most out of it by working with an advisor specializing in asset diversification.",
    "descrip1": "Looking To Invest? We walk you through the best places to put your money.",
    "vid1": "TiSDmCjPVhU",
    "vid2": "7gkQHSW3hkE",
    "vid3": "D-rMb9Znfn8",
    "img1": "/assets1.png",
    "img2": "/assets2.jpg",
    "img3": "/assets3.jpg",
    "vertical": "asset",
    "key": "3",
    "video": "Pro Market Strategies",
    "videoSummary": "Leading Traders Offer You Up To Date Trading Advice"
  },
  {
    "navtext": "Credit",
    "name": "Debt and Credit Repair",
    "articleTitle": "Key Debt Reduction Strategies To Instantly Boost Your Score.",
    "quizTitle": "Check My Credit For Loan and Credit Offers",
    "vlogTitle": "Credit Crunch",

    "descrip1": "Owe money? Trying to boost your score? Follow our tips here. ",
    "summary": "Are you in over your head in debt? Looking to take out a loan to buy a house? Somewhere in between and need info on your credit and how to maximize it, Wallet Warriors provides you with resources and companies that assist with all aspects of debt and credit management. We provide resources for those who are looking to build the next great thing, and for the guy who fell behind and needs to pull his head above water.",
    "vid1": "N6QdxWyP8HI",
    "vid2": "WZ8qfJyNlZk",
    "vid3": "YHJ66hOwDQE",
    "img1": "/credit1.png",
    "img2": "/credit2.jpeg",
    "img3": "/credit3.jpg",
    "vertical": "credit",
    "key": "4",
    "video": "Credit Crunch",
    "videoSummary": "A Quick Look At How To Boost Your Credit Score"
  },
  {
    "navtext": "Software",
    "name": "Tax And Accounting Software",
    "descrip1": "Trying to do it yourself? Looking for tools to run your company? We can help.",
    "articleTitle": "Top Tools to Manage My Business",
    "quizTitle": "I Need A Custom Business App",
    "vlogTitle": "Software Suite Previews",

    "summary": "Everything is online these days. Banking, buying, selling, all of our major financial transaction. If you are looking for ways to improve your home or business work flow by the addition of a piece of tax or accounting software or other business related app, we partner with some of the top consultants who can design custom application packages for you.",
    "vid1": "HmTVyt3MIZg",
    "vid2": "fNjdkVanBH4",
    "vid3": "KQ5tLX87KmA",
    "img1": "/software1.png",
    "img2": "/software2.jpg",
    "img3": "/software3.jpg",
    "vertical": "software",
    "key": "5",
    "video": "Software Suite Previews",
    "videoSummary": "Watch Demos of Popular ERP and CRM integrations"
  }
]
